package lesson_11;


// Ctrl + / Закоментировать строку
// На компьютере будет создан файл Hello.java #
// Название класса ДОЛЖНО совпадать с названием класса

// Функция в Phyton = метод в Java - это набор иструкций, который выполняеться вместе
// Метод main - это специальный метод который говорит Java с чего начинать выполнять программу

// /*.... */ - Многострочный коментарий аналог """ .... в Phyton

    // Если мы хотим что-то переименовать (Класс или имя переменной, название метода и и.т.д) -
    // нужно пользоваться комантой Rename (Schift +F6)
public class Hello {
    /*
    1. Команда 1
    2. Команда 2
     */

    // 1. psvm; 2. main

    // Метод Main - стартовая точка программы
    public static void main(String[] args) {
        // Мы можем написать инструкцию, которые будут выполнены

        //sout
        System.out.println("Hello world!");
        //Ctrl + y - Cmd + <-- - Удаление строки

    }

}
